; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	thermograph0 - mode
	image1 - mode
	thermograph2 - mode
	thermograph3 - mode
	GroundStation3 - direction
	GroundStation4 - direction
	Star6 - direction
	GroundStation7 - direction
	GroundStation14 - direction
	GroundStation12 - direction
	Star2 - direction
	Star11 - direction
	Star13 - direction
	Star1 - direction
	GroundStation8 - direction
	Star10 - direction
	Star9 - direction
	Star0 - direction
	GroundStation5 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Planet18 - direction
	Planet19 - direction
	Planet20 - direction
	Star21 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star0)
	(supports instrument1 thermograph0)
	(supports instrument1 image1)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star9)
	(calibration_target instrument1 Star10)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star21)
	(supports instrument2 thermograph3)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 GroundStation12)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 Star13)
	(calibration_target instrument3 GroundStation8)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument4 image1)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star13)
	(calibration_target instrument4 GroundStation5)
	(calibration_target instrument4 Star9)
	(calibration_target instrument4 Star11)
	(calibration_target instrument4 Star10)
	(supports instrument5 thermograph0)
	(supports instrument5 image1)
	(supports instrument5 thermograph3)
	(calibration_target instrument5 Star1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation12)
	(supports instrument6 image1)
	(supports instrument6 thermograph3)
	(calibration_target instrument6 GroundStation5)
	(calibration_target instrument6 Star0)
	(calibration_target instrument6 Star9)
	(calibration_target instrument6 Star10)
	(calibration_target instrument6 GroundStation8)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon16)
)
(:goal (and
	(have_image Phenomenon15 thermograph2)
	(have_image Phenomenon16 thermograph3)
	(have_image Phenomenon17 thermograph0)
	(have_image Planet18 thermograph0)
	(have_image Planet19 thermograph3)
	(have_image Planet20 thermograph3)
	(have_image Star21 thermograph0)
))

)

; plan
1. (turn_to satellite0 star1 star21)
   deleted: (pointing satellite0 star21)
   added: (pointing satellite0 star1)
   goals met: 0 of 7
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 7
3. (calibrate satellite0 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 0 of 7
4. (turn_to satellite0 planet18 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet18)
   goals met: 0 of 7
5. (take_image satellite0 planet18 instrument1 thermograph0)
   added: (have_image planet18 thermograph0)
   goals met: 1 of 7
6. (turn_to satellite0 phenomenon17 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 phenomenon17)
   goals met: 1 of 7
7. (take_image satellite0 phenomenon17 instrument1 thermograph0)
   added: (have_image phenomenon17 thermograph0)
   goals met: 2 of 7
8. (turn_to satellite0 phenomenon16 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon16)
   goals met: 2 of 7
9. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 7
10. (calibrate satellite1 instrument3 star2)
   added: (calibrated instrument3)
   goals met: 2 of 7
11. (take_image satellite0 phenomenon16 instrument1 thermograph3)
   added: (have_image phenomenon16 thermograph3)
   goals met: 3 of 7
12. (turn_to satellite0 planet19 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 planet19)
   goals met: 3 of 7
13. (take_image satellite0 planet19 instrument1 thermograph3)
   added: (have_image planet19 thermograph3)
   goals met: 4 of 7
14. (turn_to satellite0 planet20 planet19)
   deleted: (pointing satellite0 planet19)
   added: (pointing satellite0 planet20)
   goals met: 4 of 7
15. (take_image satellite0 planet20 instrument1 thermograph3)
   added: (have_image planet20 thermograph3)
   goals met: 5 of 7
16. (turn_to satellite0 star21 planet20)
   deleted: (pointing satellite0 planet20)
   added: (pointing satellite0 star21)
   goals met: 5 of 7
17. (take_image satellite0 star21 instrument1 thermograph0)
   added: (have_image star21 thermograph0)
   goals met: 6 of 7
18. (turn_to satellite1 phenomenon15 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon15)
   goals met: 6 of 7
19. (take_image satellite1 phenomenon15 instrument3 thermograph2)
   added: (have_image phenomenon15 thermograph2)
   goals met: 7 of 7
